# Дан текст. Найдите и выведите все слова-палиндромы, содержащиеся в тексте. Регистр букв не учитывать. При проверке необходимо игнорировать знаки препинания, расположенные рядом со словами.
# Палиндром — это слово, которое одинаково читается слева направо и справа налево. Палиндромом считать слово длиной не менее 2 символов.
# Дано:
# text = """
#  Вчера Анна и Артем гуляли в парке. Анна заметила слово level на
#  старом плакате. Рядом кто-то написал radar, а чуть дальше было
#  нарисовано слово kayak. На скамейке сидел человек с книгой civic,
#  а возле фонтана дети мелом написали refer. Остальные слова в тексте
#  палиндромами не являются.
#  """
# Результат:
# ["анна", "level", "radar", "kayak", "civic", "refer"]

text = """
Вчера Анна и Артем гуляли в парке. Анна заметила слово level на
старом плакате. Рядом кто-то написал radar, а чуть дальше было
нарисовано слово kayak. На скамейке сидел человек с книгой civic,
а возле фонтана дети мелом написали refer.
"""

text = text.lower()
words = text.split()

result = []

for ind in range(len(words)):
    words[ind] = words[ind].strip(".,")
    
    if len(words[ind]) >= 2:
        if words[ind] == words[ind][::-1]:
            if words[ind] not in result:
                result.append(words[ind])

print(result)